const Util = {
    setTag(valuable) {
        const attrs = [...(valuable.skill||[]), ...(valuable.setSkill||[])]
        valuable.tags = {}
        tagMap.forEach(t => {
            attrs.forEach(a => {
                if (t.keys.filter(k => (a || "").includes(k)).length == t.keys.length) {
                    valuable.tags[t.tags[0]] = valuable.tags[t.tags[0]] || {}
                    if (t.tags[1]) {
                        valuable.tags[t.tags[0]][t.tags[1]] = true
                        if (t.tags[2]) {
                            valuable.tags[t.tags[0]][t.tags[1]][t.tags[2]] = true
                        }
                    }
                }
            })
        })
    },
    setPreffer(valuable) {
        valuable.prefer = ['t1', 't2', 't3', 't4', 't5'].sort((a, b) => Number(valuable[b]) - Number(valuable[a]))[0]
    }
}

const tagMap = [
    {keys: ['黑蝌蚪产量'], tags: ['黑蝌蚪', '黑蝌蚪产量']},
    // {keys: ['黑蝌蚪', '探索'], tags: ['黑蝌蚪', '探索增加黑蝌蚪']},
    // {keys: ['黑蝌蚪', '供奉'], tags: ['黑蝌蚪', '供奉增加黑蝌蚪']},
    {keys: ['黑蝌蚪', '升级'], tags: ['黑蝌蚪', '升级家园降低黑蝌蚪']},
    {keys: ['黑蝌蚪', '研究'], tags: ['黑蝌蚪', '基因研究降低黑蝌蚪']},
    {keys: ['黑蝌蚪', '克隆'], tags: ['黑蝌蚪', '克隆降低黑蝌蚪']},

    {keys: ['白蝌蚪'], tags: ['白蝌蚪']},

    {keys: ['蘑菇产量'], tags: ['蘑菇', '蘑菇产量']},
    // {keys: ['食物', '供奉'], tags: ['蘑菇', '供奉增加蘑菇']},
    {keys: ['神奇蘑菇'], tags: ['神奇蘑菇']},
    
    {keys: ['探索加速产量'], tags: ['探索加速', '探索加速产量']},
    {keys: ['时间宝箱碎片概率'], tags: ['时间宝箱碎片概率']},
    
    {keys: ['木材产量'], tags: ['木材', '木材产量']},
    {keys: ['远古化石'], tags: ['木材', '远古化石']},
    // {keys: ['木材', '供奉'], tags: ['木材', '供奉增加木材']},
    {keys: ['木材消耗'], tags: ['木材', '木材消耗降低']},
    
    {keys: ['石材产量'], tags: ['石材', '石材产量']},
    {keys: ['千年古木'], tags: ['石材', '千年古木']},
    // {keys: ['石材', '供奉'], tags: ['石材', '供奉增加石材']},
    {keys: ['石材消耗'], tags: ['石材', '石材消耗降低']},

    {keys: ['探索移动速度'], tags: ['探索移动速度']},
    {keys: ['供奉速度'], tags: ['供奉速度']},
    {keys: ['情报点'], tags: ['情报点']},

    {keys: ['炼金试剂', '探索'], tags: ['炼金试剂', '探索获得增加']},
    {keys: ['炼金试剂', '合成'], tags: ['炼金试剂', '合成数量增加']},

    {keys: ['宝箱碎片', '供奉'], tags: ['供奉宝箱增加']},
    {keys: ['魔神宝箱'], tags: ['魔神宝箱增加']},

    {keys: ['勋章产量'], tags: ['勋章产量增加']},
    {keys: ['勋章消耗降低'], tags: ['勋章消耗降低']},

    {keys: ['蜗牛攻击'], tags: ['攻击']},
    {keys: ['蜗牛追击'], tags: ['追击']},
    {keys: ['蜗牛防御'], tags: ['防御']},
    {keys: ['蜗牛生命'], tags: ['生命']},

    {keys: ['所有基因', '研究速度'], tags: ['基因加速', '所有基因']},
    {keys: ['所有基因', '免费时间'], tags: ['基因加速', '所有基因']},
    {keys: ['机械类', '研究速度'], tags: ['基因加速', '机械类']},
    {keys: ['机械类', '免费时间'], tags: ['基因加速', '机械类']},
    {keys: ['恶魔类', '研究速度'], tags: ['基因加速', '恶魔类']},
    {keys: ['恶魔类', '免费时间'], tags: ['基因加速', '恶魔类']},
    {keys: ['丧尸类', '研究速度'], tags: ['基因加速', '丧尸类']},
    {keys: ['丧尸类', '免费时间'], tags: ['基因加速', '丧尸类']},
    {keys: ['异种', '研究速度'], tags: ['基因加速', '异种']},
    {keys: ['异种', '免费时间'], tags: ['基因加速', '异种']},
    {keys: ['天使', '研究速度'], tags: ['基因加速', '天使']},
    {keys: ['天使', '免费时间'], tags: ['基因加速', '天使']},

    {keys: ['所有兵种', '克隆速度'], tags: ['克隆加速', '所有兵种']},
    {keys: ['机械类', '克隆速度'], tags: ['克隆加速', '机械类']},
    {keys: ['恶魔类', '克隆速度'], tags: ['克隆加速', '恶魔类']},
    {keys: ['丧尸类', '克隆速度'], tags: ['克隆加速', '丧尸类']},
    {keys: ['异种类', '克隆速度'], tags: ['克隆加速', '异种类']},
    {keys: ['天使类', '克隆速度'], tags: ['克隆加速', '天使类']},
    {keys: ['巨龙类', '克隆速度'], tags: ['克隆加速', '巨龙类']},
    
    {keys: ['探索', '卡片'], tags: ['探索获得更多卡片']},
    {keys: ['劳务派遣', '完成速度'], tags: ['劳务派遣加速']},
    
    {keys: ['机械类', '上阵'], tags: ['兵种上阵', '机械类']},
    {keys: ['恶魔类', '上阵'], tags: ['兵种上阵', '恶魔类']},
    {keys: ['丧尸类', '上阵'], tags: ['兵种上阵', '丧尸类']},
    {keys: ['异种类', '上阵'], tags: ['兵种上阵', '异种类']},
    {keys: ['天使类', '上阵'], tags: ['兵种上阵', '天使类']},
    {keys: ['巨龙类', '上阵'], tags: ['兵种上阵', '巨龙类']},

    {keys: ['细胞', '探索', '机械'], tags: ['魔神细胞', '机械', '探索数量增加']},
    {keys: ['细胞', '探索', '恶魔'], tags: ['魔神细胞', '恶魔', '探索数量增加']},
    {keys: ['细胞', '探索', '丧尸'], tags: ['魔神细胞', '丧尸', '探索数量增加']},
    {keys: ['细胞', '探索', '异种'], tags: ['魔神细胞', '异种', '探索数量增加']},
    {keys: ['细胞', '探索', '天使'], tags: ['魔神细胞', '天使', '探索数量增加']},
    {keys: ['细胞', '探索', '魔神'], tags: ['魔神细胞', '所有', '探索数量增加']},

    {keys: ['细胞', '研究', '机械'], tags: ['魔神细胞', '机械', '研究消耗降低']},
    {keys: ['细胞', '研究', '恶魔'], tags: ['魔神细胞', '恶魔', '研究消耗降低']},
    {keys: ['细胞', '研究', '丧尸'], tags: ['魔神细胞', '丧尸', '研究消耗降低']},
    {keys: ['细胞', '研究', '异种'], tags: ['魔神细胞', '异种', '研究消耗降低']},
    {keys: ['细胞', '研究', '天使'], tags: ['魔神细胞', '天使', '研究消耗降低']},
    
    {keys: ['置于扶桑博物馆'], tags: ['置于扶桑博物馆']},
    {keys: ['置于高丽博物馆'], tags: ['置于高丽博物馆']},
    {keys: ['置于华夏博物馆'], tags: ['置于华夏博物馆']},
    {keys: ['置于米国博物馆'], tags: ['置于米国博物馆']},
    {keys: ['置于英伦博物馆'], tags: ['置于英伦博物馆']},
    {keys: ['置于希域博物馆'], tags: ['置于希域博物馆']},
    {keys: ['置于埃罗博物馆'], tags: ['置于埃罗博物馆']},
    {keys: ['置于天竺博物馆'], tags: ['置于天竺博物馆']},
    {keys: ['置于蝌蚪池'], tags: ['置于蝌蚪池']},
    {keys: ['置于时光机'], tags: ['置于时光机']},
    {keys: ['置于蘑菇园'], tags: ['置于蘑菇园']},
    {keys: ['置于石材工坊'], tags: ['置于石材工坊']},
    {keys: ['置于木材工坊'], tags: ['置于木材工坊']},
    {keys: ['置于基因模拟装置'], tags: ['置于基因模拟装置']},
    {keys: ['置于探索罗盘'], tags: ['置于探索罗盘']},

    {keys: ['暴击率'], tags: ['暴击',' 暴击率']},
    {keys: ['暴击概率'], tags: ['暴击','暴击率']},
    {keys: ['暴击伤害'], tags: ['暴击','暴击伤害']},
]

module.exports = Util
